snlkuharlocal/src/Documents/ЗапросКодовМаркировки/ЗапросКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросКодовМаркировки</name>
  <basedOn>Catalog.Номенклатура</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗапросКодовМаркировки/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоКодамНоменклатуры(Команда)
	//Валетов + 15,01,25 Заполнение по кодам номенклатуры. https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1895
	СТрВвода = "";
	Если Объект.товары.Количество() > 0 Тогда
		Текст = "ТЧ товары будет очищена перед заполнением. Продолжить?";
		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, );
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Товары.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ВвестиСтроку(СТрВвода,"Введите коды номенклатуры ",,Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СТрВвода, Символы.ПС) Цикл
			
			Номэл = Справочники.Номенклатура.НайтиПоКоду(Строка);
			
			Если не Номэл = Неопределено Тогда
				Если НЕ Номэл.ЭтоГруппа Тогда
					СтрТовары = Объект.Товары.Добавить();
					СтрТовары.Номенклатура   = Номэл;
					СтрТовары.ГТИН           = Номэл.ГТИН;
				КонецЕсли;
			КонецЕсли
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
